app/controllers/folders_controller.rb

SELECT "folders".* FROM "folders"
---
  def index
    @folders = Folder.all

SELECT "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT 1  [["id", "habubaba"]]
---
  def show
    @folder = Folder.find(params[:id])

SELECT "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @folder = Folder.find(params[:id])

INSERT INTO "folders" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 21 Apr 2012 17:59:52 UTC +00:00], ["name", "Przedmiot A"], ["updated_at", Sat, 21 Apr 2012 17:59:52 UTC +00:00]]
---
  def create
    @folder = Folder.new(params[:folder])

    respond_to do |format|
      if @folder.save