app/controllers/notes_controller.rb

  def create
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "opis opis"], ["created_at", Sat, 21 Apr 2012 18:00:57 UTC +00:00], ["title", "Notatka #1"], ["updated_at", Sat, 21 Apr 2012 18:00:57 UTC +00:00]]